The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyMismatchCircuit { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyMismatchCircuit As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyMismatchCircuit {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace